app/views/comments/_comment.html.erb

<p>
    <strong><%= comment.user.nickname %></strong> <small><%= time_ago_in_words(comment.created_at) %></small> <%= comment.user.location %>
---
INSERT INTO "comments" ("body", "created_at", "updated_at", "user_id", "topic_id") VALUES (?, ?, ?, ?, ?)  [["body", "bfgbb"], ["created_at", "2020-02-22 11:30:23.397574"], ["updated_at", "2020-02-22 11:30:23.397574"], ["user_id", 1], ["topic_id", 9]]