app/views/topics/show.html.erb

<hr/>
<h2><%= @topic.comments.count %> Comments </h2>
---
SELECT "comments".* FROM "comments" WHERE "comments"."topic_id" = ?  [["topic_id", 6]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."topic_id" = ?  [["topic_id", 6]]