app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "created_at", "updated_at", "user_id", "topic_id") VALUES (?, ?, ?, ?, ?)  [["body", "bfgbb"], ["created_at", "2020-02-22 11:30:23.397574"], ["updated_at", "2020-02-22 11:30:23.397574"], ["user_id", 1], ["topic_id", 9]]
---
    def create
      @comment = @topic.comments.create(params[:comment].permit(:body, :topic_id))

SELECT  "comments".* FROM "comments" WHERE "comments"."topic_id" = ? AND "comments"."id" = ? LIMIT ?  [["topic_id", 9], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
    def destroy
      @comment = @topic.comments.find(params[:id])
      @comment.destroy

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."topic_id" = ? AND "comments"."id" = ? LIMIT ?  [["topic_id", 9], ["id", 2], ["LIMIT", 1]]
---
    def edit
      @topic = Topic.find(params[:topic_id])
      @comment = @topic.comments.find(params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."topic_id" = ? AND "comments"."id" = ? LIMIT ?  [["topic_id", 9], ["id", 2], ["LIMIT", 1]]
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "Commento due da cambiare"], ["updated_at", "2020-02-22 11:18:53.548129"], ["id", 2]]
---
    def update
      @comment = @topic.comments.find(params[:id])
       respond_to do |format|
        if @comment.update(comment_params)

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def set_topic
      @topic = Topic.find(params[:topic_id])